TasksBack/app/Models/taskModel.php

SELECT *
FROM `tasks`
WHERE `Status` = 'Activo'
---
    public function getTasks()
    {
        $query = $this->db->table($this->tableTasks)
            ->where('Status', 'Activo');
        return $query->get()->getResultArray();